In [1]:
import pandas as pd
import numpy as np

In [2]:
path ="D:\ML2023\score.csv"
df = pd.read_csv(path)

In [3]:
df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,MathScore,ReadingScore,WritingScore
0,0,female,group B,bachelor's degree,standard,none,72,72,74
1,1,female,group C,some college,standard,completed,69,90,88
2,2,female,group B,master's degree,standard,none,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,47,57,44
4,4,male,group C,some college,standard,none,76,78,75

In [4]:
print(df.dtypes)

Unnamed: 0       int64
Gender          object
EthnicGroup     object
ParentEduc      object
LunchType       object
TestPrep        object
MathScore        int64
ReadingScore     int64
WritingScore     int64
dtype: object

In [5]:
df.describe()

         Unnamed: 0     MathScore  ReadingScore  WritingScore
count  30641.000000  30641.000000  30641.000000  30641.000000
mean     499.556607     66.749355     69.624980     68.468327
std      288.747894     15.206049     14.671572     15.307814
min        0.000000      0.000000     10.000000      5.000000
25%      249.000000     56.000000     60.000000     58.000000
50%      500.000000     67.000000     70.000000     69.000000
75%      750.000000     78.000000     80.000000     79.000000
max      999.000000    100.000000    100.000000    100.000000

In [6]:
df.describe(include='all')

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,MathScore,ReadingScore,WritingScore
count,30641.000000,30641,30641,30641,30641,30641,30641.000000,30641.000000,30641.000000
unique,NaN,2,5,6,2,2,NaN,NaN,NaN
top,NaN,female,group C,some college,standard,none,NaN,NaN,NaN
freq,NaN,15424,9816,7048,19905,20068,NaN,NaN,NaN
mean,499.556607,NaN,NaN,NaN,NaN,NaN,66.749355,69.624980,68.468327
std,288.747894,NaN,NaN,NaN,NaN,NaN,15.206049,14.671572,15.307814
min,0.000000,NaN,NaN,NaN,NaN,NaN,0.000000,10.000000,5.000000
25%,249.000000,NaN,NaN,NaN,NaN,NaN,56.000000,60.000000,58.000000
50%,500.000000,NaN,NaN,NaN,NaN,NaN,67.000000,70.000000,69.000000
75%,750.000000,NaN,NaN,NaN,NaN,NaN,78.000000,80.000000,79.000000
max,999.000000,NaN,NaN,NaN,NaN,NaN,100.000000,100.000000,100.000000

In [10]:
df.mean(numeric_only=True)

Unnamed: 0      499.556607
MathScore        66.749355
ReadingScore     69.624980
WritingScore     68.468327
dtype: float64

In [9]:
df.sum()

Unnamed: 0                                               15306914
Gender          femalefemalefemalemalemalefemalefemalemalemale...
EthnicGroup     group Bgroup Cgroup Bgroup Agroup Cgroup Bgrou...
ParentEduc      bachelor's degreesome collegemaster's degreeas...
LunchType       standardstandardstandardfree/reducedstandardst...
TestPrep        nonecompletednonenonenonenonecompletednonecomp...
MathScore                                                 2045267
ReadingScore                                              2133379
WritingScore                                              2097938
dtype: object

In [13]:
df.median(numeric_only=True)

Unnamed: 0      500.0
MathScore        67.0
ReadingScore     70.0
WritingScore     69.0
dtype: float64

In [15]:
df.std(numeric_only=True)

Unnamed: 0      288.747894
MathScore        15.206049
ReadingScore     14.671572
WritingScore     15.307814
dtype: float64

In [18]:
df.quantile(0.75,numeric_only=True)

Unnamed: 0      750.0
MathScore        78.0
ReadingScore     80.0
WritingScore     79.0
Name: 0.75, dtype: float64

In [20]:
df['Gender'].value_counts()

female    15424
male      15217
Name: Gender, dtype: int64

In [21]:
df.loc[:,'ReadingScore':].corr()

              ReadingScore  WritingScore
ReadingScore      1.000000      0.953095
WritingScore      0.953095      1.000000

In [22]:
df.groupby('Gender')['ReadingScore'].std()

Gender
female    14.183204
male      14.317544
Name: ReadingScore, dtype: float64

In [23]:
df.groupby('Gender')['ReadingScore'].mean()

Gender
female    73.093815
male      66.108957
Name: ReadingScore, dtype: float64